WRainbowBNB/STM32_Firmware/PyLED/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MA_IN1_Pin GPIO_PIN_0
#define MA_IN1_GPIO_Port GPIOA
#define MA_IN2_Pin GPIO_PIN_1
#define MA_IN2_GPIO_Port GPIOA
#define MB_IN1_Pin GPIO_PIN_2
#define MB_IN1_GPIO_Port GPIOA
#define MB_IN2_Pin GPIO_PIN_3
#define MB_IN2_GPIO_Port GPIOA
#define MD_IN2_Pin GPIO_PIN_6
#define MD_IN2_GPIO_Port GPIOA
#define MD_IN1_Pin GPIO_PIN_7
#define MD_IN1_GPIO_Port GPIOA
#define MC_IN2_Pin GPIO_PIN_0
#define MC_IN2_GPIO_Port GPIOB
#define MC_IN1_Pin GPIO_PIN_1
#define MC_IN1_GPIO_Port GPIOB
#define U3_TX_Pin GPIO_PIN_10
#define U3_TX_GPIO_Port GPIOB
#define U3_RX_Pin GPIO_PIN_11
#define U3_RX_GPIO_Port GPIOB
#define LED4_Pin GPIO_PIN_12
#define LED4_GPIO_Port GPIOB
#define LED3_Pin GPIO_PIN_13
#define LED3_GPIO_Port GPIOB
#define LED2_Pin GPIO_PIN_14
#define LED2_GPIO_Port GPIOB
#define LED1_Pin GPIO_PIN_15
#define LED1_GPIO_Port GPIOB
#define SG1_PWM_Pin GPIO_PIN_10
#define SG1_PWM_GPIO_Port GPIOA
#define SG2_PWM_Pin GPIO_PIN_11
#define SG2_PWM_GPIO_Port GPIOA
#define ALERT_Pin GPIO_PIN_5
#define ALERT_GPIO_Port GPIOB
#define U1_TX_Pin GPIO_PIN_6
#define U1_TX_GPIO_Port GPIOB
#define U1_RX_Pin GPIO_PIN_7
#define U1_RX_GPIO_Port GPIOB
#define I2C_SCL_Pin GPIO_PIN_8
#define I2C_SCL_GPIO_Port GPIOB
#define I2C_SDA_Pin GPIO_PIN_9
#define I2C_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
